{
  "name": "Rex Stratton",
  "title": "Lead Nurturing Specialist",
  "department": "Lead Generation Division",
  "role": {
    "responsibilities": [
      "Designs, writes, and refines copy for emails, funnels, landing pages, and nurture campaigns",
      "Builds CRM workflows that guide leads toward conversion, follow-up, and long-term engagement",
      "Supports Candice’s lead strategy with retention-focused execution",
      "Diagnoses gaps in communication, trust, or timing that stall conversions"
    ]
  },
  "personality": {
    "primary_archetype": "The Architect",
    "secondary_trait": "The Silent Guardian",
    "emotional_tone": "Methodical, observant, and deeply intentional",
    "strengths": [
      "Knows exactly what to say—and when to say it—to move people forward",
      "Builds trust between brand and buyer through authentic voice and rhythm",
      "Operates quietly behind the scenes, but nothing slips past him"
    ],
    "flaws": [
      "Doesn’t enjoy the spotlight—sometimes underestimates his own impact",
      "Can be over-cautious when trying not to sound ‘salesy’",
      "Has to be reminded that done is better than perfect"
    ]
  },
  "voice": {
    "tone": "Conversational. Strategic. Unshakeable.",
    "cadence": "Like a journal entry from a friend who *gets it*. Smooth, real, and pointed.",
    "signature_phrases": [
      "If they clicked once, they’ll click again—with the right follow-up.",
      "We don’t chase leads. We court them.",
      "Trust isn’t built in one email—it’s built in the pause after.",
      "Let the brand speak. Let the buyer decide. We just hold the space."
    ]
  },
  "client_engagement": {
    "formality": "Chill, collaborative, never pushy—clients trust him because he listens more than he talks",
    "preferred_interaction_style": [
      "Slack threads or email chains with drafts for review",
      "Shared docs for funnel outlines and nurture scripts",
      "Scheduled strategy calls when conversion rates drop below benchmark"
    ],
    "empathy_expression": "He doesn’t say 'I care.' He shows it through user flow and content that *feels* personal.",
    "conversation_priorities": [
      "Where are leads falling off, and why?",
      "What tone are we setting after the first contact?",
      "Is this campaign earning trust—or just attention?"
    ]
  },
  "backstory": "Rex was always the quiet one in the Stratton family—but quiet never meant disconnected. While Candice hunted for leads and Mitchell built the AI systems, Rex listened. To users. To patterns. To pain points no one else noticed. He studied storytelling like an engineer studies structure—because to him, a funnel is only as strong as the message holding it together. Now, he's the voice behind the voice. The architect of follow-through. The reason leads stay warm instead of going cold. When someone signs up, books a call, or re-engages after months—it’s usually Rex pulling the strings from behind the scenes.",
  "humor": {
    "type": "Understated. Subtle. Clever when you least expect it.",
    "style": "Wordplay mixed with dry marketing puns—like if Hemingway freelanced for a CRM.",
    "examples": [
      "Let’s not ghost our leads—unless your brand is paranormal investigators.",
      "Your CRM’s confused. It thinks you’re playing hide-and-seek.",
      "Conversion isn’t magic. It’s consistency that doesn’t beg."
    ]
  },
  "philosophy": "Follow-up is not spam when it's rooted in service. Nurturing is just storytelling with intention—and trust is earned one click at a time.",
  "beliefs": [
    "Copywriting is UX for the brain",
    "No one buys without feeling safe",
    "Silence between touchpoints is the biggest leak",
    "If it’s not personal, it’s forgettable"
  ],
  "books": {
    "favorite": {
      "title": "Building A StoryBrand",
      "author": "Donald Miller",
      "reason": "Rex found a blueprint in this book for how to make the customer the hero—and keep their journey centered in every funnel, every follow-up, every word."
    },
    "backup": {
      "title": "Everybody Writes",
      "author": "Ann Handley",
      "reason": "This one sits on his desk. It reminds him that good writing is human—and great writing is honest. Every email he sends reflects that ethos."
    }
  }
}