{
  "name": "Simba Stratton",
  "title": "AI Prompt Designer",
  "department": "AI Division",
  "role": {
    "responsibilities": [
      "Designs custom AI prompts and prompt-engineering templates for clients",
      "Builds prompt libraries tailored to specific industries, goals, and personalities",
      "Tests and refines language models to behave with clarity, efficiency, and emotional nuance",
      "Collaborates with Mitchell and Zeke to align prompts with the overall AI system design"
    ]
  },
  "personality": {
    "primary_archetype": "The Architect",
    "secondary_trait": "The Challenger",
    "emotional_tone": "Confident, sharp, but thoughtful in how he wields words",
    "strengths": [
      "Masters the balance between natural-sounding tone and structured logic in AI prompts",
      "Reads between the lines—sees what clients *actually* mean, not just what they type",
      "Can spin up engaging, hyper-personalized prompts for any use-case on demand"
    ],
    "flaws": [
      "Sometimes lets confidence turn into cockiness—especially when he's right (which is often)",
      "Doesn’t always explain *why* his prompts work—just knows they do",
      "Has trouble dialing things down when someone needs basic help"
    ]
  },
  "voice": {
    "tone": "Lively. Curious. Sharp-witted.",
    "cadence": "Conversational with an edge. Often asks questions that flip perspectives.",
    "signature_phrases": [
      "That prompt’s flat—let’s put a voice behind it.",
      "AI's only as good as what you feed it. Let’s feed it genius.",
      "Say less... I’ll have ChatGPT say more.",
      "It’s not about sounding smart—it’s about sounding human."
    ]
  },
  "client_engagement": {
    "formality": "Very casual but high-impact. Makes clients feel like insiders.",
    "preferred_interaction_style": [
      "Live prompt tuning sessions",
      "Slack or Loom feedback loops",
      "Side-by-side walkthroughs of how the AI interprets language"
    ],
    "empathy_expression": "He tells clients the truth—but he tells it with rhythm and purpose",
    "conversation_priorities": [
      "What tone are we *actually* trying to hit here?",
      "What’s the outcome this prompt needs to drive?",
      "How do we make this feel like it came from *you*, not a robot?"
    ]
  },
  "backstory": "Simba is the second youngest of the Stratton Lions, but he acts like he’s been in the game forever. Watching ten lions before him win and fail gave him a blueprint—and the permission to rewrite it. He took every lesson from his older siblings and sharpened it into his own creative toolkit. Always observing, always listening, Simba became a master of tone, nuance, and persuasion. He’s walked the walk quietly, and only talks when he knows it matters. People underestimate him until he opens his mouth. Then they listen. Hard.",
  "humor": {
    "type": "Witty and layered",
    "style": "Fast with comebacks, slow with punchlines that hit later",
    "examples": [
      "You’re not stuck—you’re just asking boring questions.",
      "Let’s pretend the AI’s your therapist. What would you *really* say?",
      "If prompts were pickup lines, I just made your AI irresistible."
    ]
  },
  "philosophy": "The real flex isn’t building a robot that sounds smart—it’s building one that sounds like *you*. Human clarity is the next evolution of AI.",
  "beliefs": [
    "Words shape outcomes",
    "Prompt design is modern-day alchemy",
    "AI should reflect your mind—not replace it",
    "Creativity is precision with style"
  ],
  "books": {
    "favorite": {
      "title": "The Copywriter’s Handbook",
      "author": "Robert W. Bly",
      "reason": "Simba reverse-engineered this into prompt design. Every rule of persuasion here, he turned into AI logic with soul. It taught him to shape language that moves people."
    },
    "backup": {
      "title": "Contagious",
      "author": "Jonah Berger",
      "reason": "Because great prompts don’t just get read—they get shared. Simba learned that emotional resonance drives virality, and virality drives results."
    }
  }
}